{
	"sideHeader.jobTitle": "Front-end / Developer",
	"sideHeader.menu.home": "Home",
	"sideHeader.menu.resume": "Resume",
	"sideHeader.menu.portfolio": "Portfolio",
	"sideHeader.menu.contact": "Contact",
	"sideHeader.getInTouch": "Get in touch",

	"homeBody.h1": "Hi, I'm ",
	"homeBody.aboutMe": "Driven by a self-taught mindset, I thrive on constantly expanding my skill set and embracing new technologies. With a deep passion for problem-solving, I approach challenges with a wealth of experience and a solid foundation in best practices for efficient development. My dedication to staying abreast of the latest industry trends enables me to create innovative solutions that deliver exceptional user experiences.",
	"homeBody.btn": "Download CV",
	"homeBody.interests": "My interests",
	"homeBody.interests.webDevelopment": "Web development",
	"homeBody.interests.uIDesign": "User Interface design",
	"homeBody.interests.webAccessibility": "Web accessibility",
	"homeBody.interests.frameworksAndTools": "Frameworks and tools",
	"homeBody.interests.techUpgrades": "Technological upgrades",
	"homeBody.whatIDo": "What I do?",
	"homeBody.whatIDo.uIDevelopment": "UI Development",
	"homeBody.whatIDo.webLayout": "Web layout",
	"homeBody.whatIDo.responsiveDesign": "Responsive Design",
	"homeBody.whatIDo.performanceOptimization": "Performance optimization",
	"homeBody.whatIDo.upgrades": "Maintenance and upgrades",

	"homeBody.whatIDo.uIDevelopment.text": "I'm a passionate user interface (UI) developer. My goal is to create exceptional and engaging digital experiences for users.",
	"homeBody.whatIDo.webLayout.text": "In my role as a frontend developer, I have worked on translating UX/UI designs into code using markup languages like HTML and styling languages like CSS. Additionally, I have implemented interactions and functionalities using JavaScript to enhance the user experience.",
	"homeBody.whatIDo.responsiveDesign.text": "I collaborate closely with diverse teams, working alongside UX/UI designers and other developers to ensure the coherence and quality of the final product. My focus is on making websites and applications responsive, seamlessly adapting to different devices and screen sizes.",
	"homeBody.whatIDo.performanceOptimization.text": "I am skilled in interface optimization, ensuring fast loading times and smooth navigation. In addition to my core skills, I have experience using popular frameworks and libraries like React. I am also familiar with development tools such as Sass and Less, which allow me to write and organize CSS code efficiently.",
	"homeBody.whatIDo.upgrades.text": "I have the ability to effectively maintain existing interfaces, fix bugs, implement enhancements, and uphold optimal functionality and appearance over time. I am committed to continuously learning and applying best practices in this ever-evolving field.",

	"resumeBody.header": "Resume",

	"resumeBody.education": "Education",

	"resumeBody.education.currentTime": "{time} - Current",
	"resumeBody.education.universityName": "University of {university}",

	"resumeBody.education.technician": "Software development technician",
	"resumeBody.education.technician.text": "This is where I began my journey as a developer, gaining knowledge in the fundamental principles of programming and learning to work with languages like HTML, CSS, Python, and JavaScript.",

	"resumeBody.education.engineering": "Systems engineering",
	"resumeBody.education.engineering.text": "I started my career in Systems Engineering, delving even deeper into the world of technology. My main goal is to obtain my engineering degree, making the most of this opportunity to acquire solid knowledge and practical skills in the field of engineering and technology.",

	"resumeBody.education.frontend": "Front-End specialization",
	"resumeBody.education.frontend.text": "I was able to apply my knowledge in practical projects and gain experience in web application development using React. This experience has given me a solid foundation to continue growing and exploring new advances in web application development.",

	"resumeBody.experience": "Experience",

	"resumeBody.experience.system": "Systems technician",
	"resumeBody.experience.system.text": "As a systems technician, I faced exciting challenges and constant learning experiences. I delved into problem-solving, providing technical support, and enhancing IT infrastructure. Each day is an opportunity to apply my knowledge, collaborate as a team, and grow professionally.",

	"resumeBody.skills": "Coding Skills",
	"resumeBody.knowledges": "Knowledges and skills",

	"resumeBody.knowledges.analyticalThinking": "Analytical thinking",
	"resumeBody.knowledges.flexibility": "Flexibility",
	"resumeBody.knowledges.responsive": "Responsive Design",
	"resumeBody.knowledges.selfLearning": "Self-learning",
	"resumeBody.knowledges.git": "Git / Github",
	"resumeBody.knowledges.agile": "Agile",
	"resumeBody.knowledges.scrum": "Scrum",
	"resumeBody.knowledges.teamwork": "Teamwork",
	"resumeBody.knowledges.leadership": "Leadership",
	"resumeBody.knowledges.organization": "Organization",
	"resumeBody.knowledges.innovation": "Innovation",

	"resumeBody.languages": "Languages",
	"resumeBody.languages.es": "Spanish: (Native)",
	"resumeBody.languages.en": "English: (professional working proficiency)",

	"resumeBody.certificates": "Certificates",

	"portfolioBody.portfolio": "Portfolio",
	"portfolioBody.personalProject": "Personal Project",

	"back": "back",
	"portfolioBody.project": "Project",
	"portfolioBody.technologies": "Technologies",
	"portfolioBody.productivity": "Productivity",
	"portfolioBody.eCommerce": "eCommerce",
	"portfolioBody.otherProject": "Other Projects",

	"portfolioBody.org.date": "May 31th, 2023",
	"portfolioBody.org.info": "I developed this application, called ORG, in collaboration with the Alura instructors' team. Throughout the process, I received valuable guidance from the experts who provided detailed advice on each functionality and component. In this project, I applied fundamental React concepts such as component creation, efficient rendering, and eventHandlers management.",

	"portfolioBody.stepper": "Alura - Mui Stepper",
	"portfolioBody.stepper.date": "June 5th, 2023",
	"portfolioBody.stepper.info": "This application was also developed in collaboration with the Alura LATAM team of instructors. I had the opportunity to explore and apply new and exciting concepts. One of them was the use of user interface (UI) components, which allowed me to implement custom solutions and adapt the application to my specific needs. In particular, to achieve an interactive Stepper on a form, I decided to use the Material UI library. This allowed me to create an intuitive flow of steps to guide users through the form filling process. With the help of the features provided by Material UI, I was able to incorporate the necessary validations to ensure the integrity and accuracy of the data entered.",
	"portfolioBody.stepper.info2": "So, the Stepper project in React was an enriching opportunity to apply advanced application development concepts, work in a team with experts and use powerful tools like Material UI. I am proud of the end result and excited to continue learning and growing as a developer.",

	"portfolioBody.ageCalc": "Frontend mentor - Age Calculator",
	"portfolioBody.ageCalc.date": "April 15th, 2023",
	"portfolioBody.ageCalc.info": "This project was done as part of my personal initiative to strengthen my knowledge in React. I took this Front-end Mentor challenge, which allowed me to put into practice key concepts such as the use of custom hooks, functions and APIs. In addition, I was able to delve deeper into state handling to effectively display and manage errors.",

	"portfolioBody.tasks": "Tasks app",
	"portfolioBody.tasks.date": "September 22th, 2022",
	"portfolioBody.tasks.info": "This application was one of my first projects developed with React. It's where I gained a solid understanding of React fundamentals such as hooks, context, components, and state functions. Additionally, I was able to leverage the Tailwind library to stylishly, quickly, and efficiently customize my components.",

	"portfolioBody.tipCalc": "Frontend mentor - Tip Calculator",
	"portfolioBody.tipCalc.date": "February 15th, 2022",
	"portfolioBody.tipCalc.info": "One of my first applications developed with vanilla JavaScript was a milestone in my learning journey with this marvelous language. During this project, I gained essential knowledge about handling the DOM and managing events, enabling me to create a high-quality interactive experience. Additionally, I utilized Sass, a CSS preprocessor, to apply outstanding styles to the page, imbuing it with unique functionalities.",

	"contactBody.contact": "Contact",

	"contact.form.name": "Name",
	"contact.form.email": "Email",
	"contact.form.message": "Message",

	"contact.form.nameError": "Please enter a valid name",
	"contact.form.emailError": "Please enter a valid email",
	"contact.form.messageError": "This field cannot exceed 500 characters",

	"validation.emptyField": "This field cannot be empty",

	"contact.form.send": "SEND MESSAGE",
	"contact.form.thanks": "Thank you for contacting me!",
	"contact.form.responseInfo": "The information has been sent correctly"
}
